<?php
// 共通定数
return [
    'home' => [
        'infoKindSlider' => 1,
        'infoKindGrid' => 2,
        'infoKindList' => 3,
    ],
    'lessonBooking' => [
        'startTimeOptions' => [
            '05:00','06:00','07:00','08:00','09:00',
            '10:00','11:00','12:00','13:00','14:00',
            '15:00','16:00','17:00','18:00','19:00',
            '20:00','21:00'
        ],
        'endTimeOptions' => [
            '06:00','07:00','08:00','09:00','10:00',
            '11:00','12:00','13:00','14:00','15:00',
            '16:00','17:00','18:00','19:00','20:00',
            '21:00','22:00'
        ],
    ],
    'studioLesson' => [
        'timeOptions' => [
            '06:00','07:00','08:00','09:00','10:00',
            '11:00','12:00','13:00','14:00','15:00',
            '16:00','17:00','18:00','19:00','20:00',
            '21:00','22:00'
        ],
    ],
    // カスタムエクセプション
    'customError' => [
        'httpStatusCode' => [
            'customException' => 515,
        ],
        'errorMessage' => [
            'dbError' => 'データベースへの反映に失敗しました',
            'notFoundError' => 'リンク先がありません',
        ]
    ],

    'errorMessages' => [
        'I0001' => '{1} が更新されました。',
        'I0002' => '{1} が登録されました。',
        'I0003' => '{1} が完了しました。',

        'E0005' => '{1} を入力してください。',
        'E0007' => '{1} を選択してください。',
        'E0011' => '{1} の入力文字は {2} までとしてください。',
        'E0042' => '{1} に失敗しました。',
    ],

];